Revit 2024 API
MEPAnalyticalSegment.RevitElementId Property
 The id of the owning Revit element.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public ElementId RevitElementId { get; }
Visual Basic
Public ReadOnly Property RevitElementId As ElementId
	Get
Visual C++
public:
property ElementId^ RevitElementId {
	ElementId^ get ();
}
See Also
MEPAnalyticalSegment Class
Autodesk.Revit.DB.Analysis Namespace